KenyaSpaceAgency/BMS_STM32L476RCT6/Core/Src/app/BMS_Service.c
// ====================== EXTERNAL VARIABLES ======================

// These are shared variables that are defined in the `.c` file and used across the system

extern BQ76920_t bms_instance1;  // First BMS IC instance
extern BQ76920_t bms_instance2;  // Optional second BMS IC for redundancy or multi-stack
extern TelemetryData telemetry;  // Global structure holding current telemetry data

#endif /* BMS_SERVICE_H */  // File: BMS_Service.c
// Created on: Jun 29, 2025
// Author: yomue
// Purpose: Manages the core BMS functionality, including initialization, measurements,
//          alerts, SOC/SOH calculations, and flash storage.

// Include header files needed for the code
#include "main.h"             // Main project header with TelemetryData and GPIO definitions
#include "BMS_Service.h"      // BMS service definitions (e.g., thresholds, function prototypes)
#include "flash.h"            // Flash memory functions for storing telemetry
#include "temperature.h"      // Temperature sensor and heater control functions
#include <math.h>             // Math functions like fminf, fmaxf, fabs for calculations
#include <stdio.h>            // Printing functions for error logging (snprintf)
#include <string.h>           // String functions like strlen for logging

// External variables declared in main.c
extern I2C_HandleTypeDef hi2c1;         // I2C1 interface (PB6/PB7) for BQ76920 and TMP100
extern I2C_HandleTypeDef hi2c2;         // I2C2 interface (PB10/PB11) for second BQ76920
extern ADC_HandleTypeDef hadc1;         // ADC for PCB temperature (internal STM32 sensor)
extern UART_HandleTypeDef huart1;       // UART (PA9/PA10) for error logging

// Declare error logging function (defined in main.c)
void Log_Error(const char *format, ...);

// Declare internal functions (static, only used in this file)
static float Read_PCB_Temperature(void); // Reads PCB temperature using STM32 ADC
static void Enter_SHIP_Mode(BQ76920_t *BMS); // Puts BQ76920 into low-power mode

// Static variables for state management (only accessible in this file)
static float last_soc = 0.0f;           // Stores the last SOC value for flash storage checks
static uint32_t last_save_time = 0;     // Tracks the last time telemetry was saved to flash
static uint32_t low_power_timer = 0;    // Tracks time in low SOC state for SHIP mode

// Function: BMS_CheckSanity
// Inputs:
//   - label: A string (const char*), the name of the value being checked (e.g., "Cell_IC1")
//   - value: A float, the value to check (e.g., voltage, current)
//   - min: A float, the minimum allowed value
//   - max: A float, the maximum allowed value
// Output:
//   - None (void), logs an error if the value is out of range
// Significance:
//   - Checks if a measurement (e.g., voltage, current) is within safe limits, logging errors
//     if not. Used to ensure reliable data for battery monitoring.
void BMS_CheckSanity(const char *label, float value, float min, float max) {
    // Check if the value is outside the allowed range
    if (value < min || value > max) {
        // Create a buffer to hold the error message
        char msg[128];
        // Format the error message with the label, value, and range
        snprintf(msg, sizeof(msg), "[SANITY FAIL] %s=%.2f out of range (%.2f - %.2f)\r\n",
                 label, value, min, max);
        // Send the error message over UART (huart1) for debugging
        HAL_UART_Transmit(&huart1, (uint8_t*)msg, strlen(msg), HAL_MAX_DELAY);
    }
}

// Function: Read_PCB_Temperature
// Inputs:
//   - None (void), uses global hadc1 for ADC
// Output:
//   - Returns a float, the PCB temperature in Celsius, or -273.15 if invalid
// Significance:
//   - Reads the STM32’s internal temperature sensor via ADC to monitor the PCB temperature,
//     stored in telemetry.pcb_temperature for safety checks.
float Read_PCB_Temperature(void) {
    // Start the ADC to begin temperature measurement
    HAL_ADC_Start(&hadc1);
    // Wait for the ADC conversion to complete (timeout if too long)
    HAL_ADC_PollForConversion(&hadc1, HAL_MAX_DELAY);
    // Get the raw ADC value (12-bit)
    uint32_t adc_value = HAL_ADC_GetValue(&hadc1);
    // Stop the ADC to free it for other uses
    HAL_ADC_Stop(&hadc1); // Fixed: Added &hadc1

    // Read calibration values from STM32 memory (Reference Manual, Section 15.4.29, page 463)
    uint32_t TS_CAL1 = *((uint16_t*)0x1FFF75A8); // Calibration value at 30°C
    uint32_t TS_CAL2 = *((uint16_t*)0x1FFF75CA); // Calibration value at 110°C
    // Check if calibration values are invalid (equal means no calibration)
    if (TS_CAL2 == TS_CAL1) return -273.15f; // Return absolute zero for error
    // Calculate temperature using linear interpolation
    // Formula: temp = (TS_CAL2 - TS_CAL1)/(110 - 30) * (adc_value - TS_CAL1) + 30
    float temp = ((float)(TS_CAL2 - TS_CAL1) / (110.0f - 30.0f)) * ((float)adc_value - TS_CAL1) + 30.0f;
    return temp; // Return temperature in Celsius
}

// Function: Enter_SHIP_Mode
// Inputs:
//   - BMS: A pointer to a BQ76920_t structure, holding chip data
// Output:
//   - None (void), puts the BQ76920 into SHIP mode
// Significance:
//   - Puts the BQ76920 into a low-power state to save battery when SOC is critically low,
//     critical for extending battery life in your satellite (BQ76920 datasheet, Section 8.3.5, page 22).
void Enter_SHIP_Mode(BQ76920_t *BMS) {
    uint8_t step1 = (1 << 7); // SHUT_B = 1, SHUT_A = 0
    uint8_t step2 = (1 << 6); // SHUT_A = 1, SHUT_B = 0
    BQ76920_WriteRegister(BMS, SYS_CTRL1, &step1, NULL);
    HAL_Delay(1); // Mandatory 1ms delay between steps
    BQ76920_WriteRegister(BMS, SYS_CTRL1, &step2, NULL);
}

// Function: BMS_Service_Init
// Inputs:
//   - None (void), uses global variables (hi2c1, hi2c2, telemetry)
// Output:
//   - None (void), initializes the BMS
// Significance:
//   - Initializes the BQ76920 chips and loads saved telemetry from flash, called at startup
//     in main.c to set up the BMS.
void BMS_Service_Init(void) {
    // Check if BQ76920 on I2C1 is responsive
    telemetry.i2c_comm_error_ic1 = (HAL_I2C_IsDeviceReady(&hi2c1, BQ76920_ADDRESS, 2, HAL_MAX_DELAY) != HAL_OK);
    // Check if BQ76920 on I2C2 is responsive
    telemetry.i2c_comm_error_ic2 = (HAL_I2C_IsDeviceReady(&hi2c2, BQ76920_ADDRESS, 2, HAL_MAX_DELAY) != HAL_OK);
    // Set BMS online if no I2C errors
    telemetry.bms_online = !(telemetry.i2c_comm_error_ic1 || telemetry.i2c_comm_error_ic2);

    // If BMS is online, initialize both BQ76920 chips
    if (telemetry.bms_online) {
        // Initialize first BQ76920 on I2C1
        BQ76920_Initialise(&bms_instance1, &hi2c1);
        // Initialize second BQ76920 on I2C2
        BQ76920_Initialise(&bms_instance2, &hi2c2);
        // Wait 250ms for chips to stabilize
        HAL_Delay(250);
    } else {
        // Log an error if initialization fails
        Log_Error("BMS initialization failed");
    }

