KenyaSpaceAgency/BMS_STM32L476RCT6/Core/Src/app/BMS_Service.c
    // Load saved telemetry from flash
    Flash_ReadTelemetry();
    // Record the current time for flash storage timing
    last_save_time = HAL_GetTick();
}

// Function: BMS_Service_HandleAlerts
// Inputs:
//   - None (void), uses global bms_instance1, bms_instance2, telemetry
// Output:
//   - None (void), updates alert flags and handles device-ready alerts
// Significance:
//   - Checks for alerts (e.g., overvoltage, overcurrent) from both BQ76920 chips and updates
//     communication status, ensuring the BMS responds to issues.
void BMS_Service_HandleAlerts(void) {
    // Read alerts from first BQ76920
    readAlert(&bms_instance1);
    // Read alerts from second BQ76920
    readAlert(&bms_instance2);

    // Update I2C communication status for first chip
    telemetry.i2c_comm_error_ic1 = (HAL_I2C_GetState(&hi2c1) != HAL_I2C_STATE_READY);
    // Update I2C communication status for second chip
    telemetry.i2c_comm_error_ic2 = (HAL_I2C_GetState(&hi2c2) != HAL_I2C_STATE_READY);
    // Set BMS online if no I2C errors
    telemetry.bms_online = !(telemetry.i2c_comm_error_ic1 || telemetry.i2c_comm_error_ic2);

    // Check for device-ready alerts (XREADY, bit 6 in SYS_STAT)
    if (getAlert(&bms_instance1, 6) || getAlert(&bms_instance2, 6)) {
        // Declare variable for SYS_CTRL2
        uint8_t sys_ctrl2;
        // Read SYS_CTRL2 for first BQ76920
        BQ76920_ReadRegister(&bms_instance1, SYS_CTRL2, &sys_ctrl2, NULL);
        // Set bit 2 (ALERT_EN) to handle XREADY
        sys_ctrl2 |= (1 << 2);
        // Write updated SYS_CTRL2
        BQ76920_WriteRegister(&bms_instance1, SYS_CTRL2, &sys_ctrl2, NULL);

        // Read SYS_CTRL2 for second BQ76920
        BQ76920_ReadRegister(&bms_instance2, SYS_CTRL2, &sys_ctrl2, NULL);
        // Set bit 2 (ALERT_EN) to handle XREADY
        sys_ctrl2 |= (1 << 2);
        // Write updated SYS_CTRL2
        BQ76920_WriteRegister(&bms_instance2, SYS_CTRL2, &sys_ctrl2, NULL);
    }
}

// Function: BMS_Service_ReadMeasurements
// Inputs:
//   - None (void), uses global bms_instance1, bms_instance2, telemetry
// Output:
//   - None (void), updates telemetry with measurements
// Significance:
//   - Reads voltages, currents, and PCB temperature, storing them in telemetry with
//     sanity checks to ensure valid data.
void BMS_Service_ReadMeasurements(void) {
	float temp = Read_PCB_Temperature();
	telemetry.pcb_temperature = temp;
	BMS_CheckSanity("PCB_Temp", temp, MIN_TEMPERATURE_C, MAX_TEMPERATURE_C);
	// --- TMP100 readings for pack temperature ---
	telemetry.pack_temperature_ic1 = TMP100_ReadTemperature(&hi2c1, TMP100_IC1_ADDR);
	telemetry.pack_temperature_ic2 = TMP100_ReadTemperature(&hi2c2, TMP100_IC2_ADDR);

	// Optional sanity check
	BMS_CheckSanity("TMP100_IC1", telemetry.pack_temperature_ic1, MIN_TEMPERATURE_C, MAX_TEMPERATURE_C);
	BMS_CheckSanity("TMP100_IC2", telemetry.pack_temperature_ic2, MIN_TEMPERATURE_C, MAX_TEMPERATURE_C);
    // Read current from first BQ76920 and convert to mA
    telemetry.current_ic1 = (int16_t)(getCurrent(&bms_instance1) * 1000);
    // Read current from second BQ76920 and convert to mA
    telemetry.current_ic2 = (int16_t)(getCurrent(&bms_instance2) * 1000);

    // Read cell voltages for both BQ76920 chips
    for (int i = 0; i < NUMBER_OF_CELLS; i++) { // NUMBER_OF_CELLS is 4 (BQ76920.h)
        // Read voltage for cell i from first BQ76920
        float v1 = getCellVoltage(&bms_instance1, VC1 + i * 2);
        // Read voltage for cell i from second BQ76920
        float v2 = getCellVoltage(&bms_instance2, VC1 + i * 2);

        // Store voltage in mV for first chip
        telemetry.vcell_ic1[i] = (uint16_t)(v1 * 1000);
        // Store voltage in mV for second chip
        telemetry.vcell_ic2[i] = (uint16_t)(v2 * 1000);

        // Check if voltages are within safe range (2.5V–4.3V, BMS_Service.h)
        BMS_CheckSanity("Cell_IC1", v1, MIN_CELL_VOLTAGE, MAX_CELL_VOLTAGE);
        BMS_CheckSanity("Cell_IC2", v2, MIN_CELL_VOLTAGE, MAX_CELL_VOLTAGE);
    }

    // Convert currents back to amps for sanity checks
    float current1 = telemetry.current_ic1 / 1000.0f;
    float current2 = telemetry.current_ic2 / 1000.0f;

    // Check if currents are within safe range (±30A, BMS_Service.h)
    BMS_CheckSanity("Current_IC1", current1, -MAX_PACK_CURRENT, MAX_PACK_CURRENT);
    BMS_CheckSanity("Current_IC2", current2, -MAX_PACK_CURRENT, MAX_PACK_CURRENT);


    // Store temperature in telemetry
    telemetry.pcb_temperature = temp;
    // Check if temperature is within safe range (-40°C to 85°C, BMS_Service.h)
    BMS_CheckSanity("PCB_Temp", temp, MIN_TEMPERATURE_C, MAX_TEMPERATURE_C);
}

// Function: BMS_Service_ProcessData
// Inputs:
//   - None (void), uses global bms_instance1, bms_instance2, telemetry
// Output:
//   - None (void), updates telemetry with SOC, SOH, and alerts
// Significance:
//   - Calculates SOC and SOH, updates alerts, and manages cell balancing, ensuring
//     the BMS tracks battery state and safety.
void BMS_Service_ProcessData(void) {
    // Calculate SOC for first BQ76920 (current and voltage in amps and volts)
    float soc1 = SOCPack(&bms_instance1, telemetry.current_ic1 / 1000.0f,
                         telemetry.vpack_ic1 / 1000.0f);
    // Calculate SOC for second BQ76920
    float soc2 = SOCPack(&bms_instance2, telemetry.current_ic2 / 1000.0f,
                         telemetry.vpack_ic2 / 1000.0f);
    // Average the SOC values and clamp between 0% and 100%
    telemetry.soc = fminf(fmaxf((soc1 + soc2) / 2.0f, 0.0f), 100.0f);

    // Calculate SOH for first BQ76920
    float soh1 = SOHPack(&bms_instance1);
    // Calculate SOH for second BQ76920
    float soh2 = SOHPack(&bms_instance2);
    // Average the SOH values
    telemetry.soh = (soh1 + soh2) / 2.0f;

    // Update error flags for all 8 bits
    for (int i = 0; i < 8; i++) {
        // Set flag if either BQ76920 reports an alert
        telemetry.error_flags[i] = getAlert(&bms_instance1, i) || getAlert(&bms_instance2, i);
    }

