KenyaSpaceAgency/BMS_STM32L476RCT6/Core/Src/app/BMS_Service.c
    // Update specific alerts from SYS_STAT
    telemetry.ovrd_alert_ic1 = getAlert(&bms_instance1, 5); // Overcurrent/short-circuit alert
    telemetry.ovrd_alert_ic2 = getAlert(&bms_instance2, 5);
    telemetry.device_xready_ic1 = getAlert(&bms_instance1, 6); // Device ready alert
    telemetry.device_xready_ic2 = getAlert(&bms_instance2, 6);
    telemetry.load_present_ic1 = getAlert(&bms_instance1, 7); // Load detection alert
    telemetry.load_present_ic2 = getAlert(&bms_instance2, 7);

    // Enable cell balancing for first BQ76920 if charging
    EnableBalanceCell(&bms_instance1, telemetry.current_ic1 / 1000.0f);
    // Enable cell balancing for second BQ76920 if charging
    EnableBalanceCell(&bms_instance2, telemetry.current_ic2 / 1000.0f);

    // Read balancing status for first BQ76920
    telemetry.balancing_mask_ic1 = justRead1(&bms_instance1);
    // Read balancing status for second BQ76920
    telemetry.balancing_mask_ic2 = justRead1(&bms_instance2);
    // Set balancing active if either chip is balancing
    telemetry.balancing_active = (telemetry.balancing_mask_ic1 ||
                                telemetry.balancing_mask_ic2) ? 1 : 0;

    // Set charge flag if SOC is low (<20%)
    telemetry.charge_immediately = (telemetry.soc < 20.0f) ? 1 : 0;
}

// Function: BMS_Service_UpdateCounters
// Inputs:
//   - delta_time: A uint32_t, the time elapsed since the last update (in seconds)
// Output:
//   - None (void), updates telemetry counters
// Significance:
//   - Updates time-based counters (operating, charge, discharge time) and charge cycle count,
//     tracking battery usage for telemetry.
void BMS_Service_UpdateCounters(uint32_t delta_time) {
    // Add elapsed time to total operating time
    telemetry.total_operating_time += delta_time;

    // If either chip is charging (positive current)
    if (telemetry.current_ic1 > 0 || telemetry.current_ic2 > 0) {
        // Add elapsed time to total charge time
        telemetry.total_charge_time += delta_time;
        // If SOC is nearly full (≥99%) and current is low (≤100mA), count a charge cycle
        if (telemetry.soc >= 99.0f &&
            (abs(telemetry.current_ic1) <= 100 ||
            abs(telemetry.current_ic2) <= 100)) {
            telemetry.charge_cycle_count++;
        }
    }
    // If either chip is discharging (negative current)
    else if (telemetry.current_ic1 < 0 || telemetry.current_ic2 < 0) {
        // Add elapsed time to total discharge time
        telemetry.total_discharge_time += delta_time;
    }
}

// Function: BMS_Service_HandleLowPowerCondition
// Inputs:
//   - low_power_mode: A pointer to a uint8_t, the current low-power state (1=on, 0=off)
// Output:
//   - None (void), updates low_power_mode and may enter SHIP mode
// Significance:
//   - Monitors SOC and enters SHIP mode if critically low (<5%) for 5 minutes,
//     saving battery power in critical conditions.
void BMS_Service_HandleLowPowerCondition(uint8_t *low_power_mode) {
    // If SOC is critically low (<5%)
    if (telemetry.soc < 5.0f) {
        // Add elapsed time (in seconds) to low-power timer
        low_power_timer += (HAL_GetTick() - last_save_time) / 1000;
        // If low SOC persists for 5 minutes (300 seconds)
        if (low_power_timer > 300) {
            // Enter SHIP mode for first BQ76920
            Enter_SHIP_Mode(&bms_instance1);
            // Enter SHIP mode for second BQ76920
            Enter_SHIP_Mode(&bms_instance2);
            // Set low-power mode flag
            *low_power_mode = 1;
            // Reset the timer
            low_power_timer = 0;
        }
    } else {
        // Reset the timer if SOC is above 5%
        low_power_timer = 0;
    }
}

// Function: BMS_Service_HandleLowPowerMode
// Inputs:
//   - low_power_mode: A pointer to a uint8_t, the current low-power state
// Output:
//   - None (void), attempts to wake BQ76920 chips and update mode
// Significance:
//   - Attempts to wake the BQ76920 chips from SHIP mode by toggling boot pins,
//     reinitializing them if responsive.
void BMS_Service_HandleLowPowerMode(uint8_t *low_power_mode) {
    // Wake-up sequence: toggle boot pins (BOOT1_Pin, BOOT2_Pin)
    HAL_GPIO_WritePin(bms_instance1.bootPort, bms_instance1.bootPin, GPIO_PIN_SET); // Set BOOT1 high
    HAL_GPIO_WritePin(bms_instance2.bootPort, bms_instance2.bootPin, GPIO_PIN_SET); // Set BOOT2 high
    HAL_Delay(3); // Wait 3ms for chips to respond
    HAL_GPIO_WritePin(bms_instance1.bootPort, bms_instance1.bootPin, GPIO_PIN_RESET); // Set BOOT1 low
    HAL_GPIO_WritePin(bms_instance2.bootPort, bms_instance2.bootPin, GPIO_PIN_RESET); // Set BOOT2 low
    HAL_Delay(10); // Wait 10ms for stabilization

    // Check if BQ76920 chips are responsive
    telemetry.i2c_comm_error_ic1 = (HAL_I2C_IsDeviceReady(&hi2c1, BQ76920_ADDRESS, 2, HAL_MAX_DELAY) != HAL_OK);
    telemetry.i2c_comm_error_ic2 = (HAL_I2C_IsDeviceReady(&hi2c2, BQ76920_ADDRESS, 2, HAL_MAX_DELAY) != HAL_OK);

    // If no I2C errors, reinitialize chips
    if (!(telemetry.i2c_comm_error_ic1 || telemetry.i2c_comm_error_ic2)) {
        // Clear low-power mode flag
        *low_power_mode = 0;
        // Set BMS online
        telemetry.bms_online = 1;
        // Reinitialize first BQ76920
        BQ76920_Initialise(&bms_instance1, &hi2c1);
        // Reinitialize second BQ76920
        BQ76920_Initialise(&bms_instance2, &hi2c2);
        // Wait 250ms for stabilization
        HAL_Delay(250);
    }
}

// Function: BMS_Service_HandleFlashStorage
// Inputs:
//   - None (void), uses global telemetry and static variables
// Output:
//   - None (void), saves telemetry to flash if needed
// Significance:
//   - Saves telemetry to flash when SOC changes significantly (>1%) or every 5 minutes,
//     ensuring persistent data storage.
void BMS_Service_HandleFlashStorage(void) {
    // Get the current system tick (milliseconds)
    uint32_t current_time = HAL_GetTick();

    // If SOC has changed by more than 1%
    if (fabs(telemetry.soc - last_soc) > 1.0f) {
        // Save telemetry to flash
        Flash_WriteTelemetry();
        // Update last SOC value
        last_soc = telemetry.soc;
        // Update last save time
        last_save_time = current_time;
    }
    // If 5 minutes (300,000ms) have passed since last save
    else if (current_time - last_save_time > 300000) {
        // Save telemetry to flash
        Flash_WriteTelemetry();
        // Update last save time
        last_save_time = current_time;
    }
}
